data/agiliumlabs/toSignAppData.xml.01.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<soap:Header><smev:Header xmlns:smev="http://smev.gosuslugi.ru/rev120315"><smev:NodeId>1</smev:NodeId><smev:MessageId>12311111-1111-1000-01</smev:MessageId><smev:TimeStamp>2012-02-02T00:02:02</smev:TimeStamp><smev:MessageClass>REQUEST</smev:MessageClass></smev:Header>
	</soap:Header>
	<soap:Body wsu:Id="body"><ns:PutDocument xmlns:ns="http://www.red-soft.biz/ncore/dx/ws/smev-243" xmlns="http://www.w3.org/2004/08/xop/include" xmlns:smev="http://smev.gosuslugi.ru/rev120315"><smev:Message><smev:Sender><smev:Code>ADLR01481</smev:Code><smev:Name>innovativeWork</smev:Name></smev:Sender><smev:Recipient><smev:Code>ADLR01481</smev:Code><smev:Name>The security provider should be certified, that is why there is no much choice, Crypto Pro probably is the only one available. Bouncycastle implements</smev:Name></smev:Recipient><smev:TypeCode>GSRV</smev:TypeCode><smev:Status>REQUEST</smev:Status><smev:Date>2012-02-02T02:02:02</smev:Date><smev:ExchangeType>2</smev:ExchangeType><smev:ServiceCode>SERVICE001</smev:ServiceCode><smev:CaseNumber>CASE001</smev:CaseNumber><smev:TestMsg>SMEVTEST</smev:TestMsg></smev:Message><smev:MessageData><smev:AppData Id="appDataBody" xmlns:smev="http://smev.gosuslugi.ru/rev120315"><tns:IQueryBph xmlns:tns="http://www.red-soft.biz/schemas/shgate/common/2011/0.5" xmlns:ws="http://www.red-soft.biz/ncore/dx/ws/smev-243"><tns:Area>Area52</tns:Area><tns:BuildingName>Название строения</tns:BuildingName><tns:CadastraNumber>1122334455667788</tns:CadastraNumber><tns:AddressZemUchBph><tns:City>innovativeWork</tns:City><tns:House>12</tns:House><tns:Street>Стаханова</tns:Street><tns:Region>Центральный</tns:Region><tns:Locality>Липецк</tns:Locality><tns:Building>1</tns:Building><tns:District>24</tns:District><tns:Apartment>47</tns:Apartment><tns:Structure>2</tns:Structure></tns:AddressZemUchBph></tns:IQueryBph><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><Reference URI="#appDataBody"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><DigestValue>0M7bNiOsRzd1o3FH5fycnqfF0dXEtFaRSfOgCU5fW5c=</DigestValue></Reference></SignedInfo><SignatureValue>8bFTUWxu5QaKrbNdCWCaqflnqeMRKM2eXiNcvhpy4kQzkHVVmpR+wEN93D+WNNzZBbqteUo853BX
FcbaFfHCUQ==</SignatureValue><KeyInfo><X509Data><X509Certificate>MIIDUDCCAv+gAwIBAgIKaSwK3wACAAVXoDAIBgYqhQMCAgMwZTEgMB4GCSqGSIb3DQEJARYRaW5m
b0BjcnlwdG9wcm8ucnUxCzAJBgNVBAYTAlJVMRMwEQYDVQQKEwpDUllQVE8tUFJPMR8wHQYDVQQD
ExZUZXN0IENlbnRlciBDUllQVE8tUFJPMB4XDTEzMTAwOTA5NDUwNFoXDTE0MTAwNDA3MDk0MVow
gY4xKjAoBgkqhkiG9w0BCQEWG3N0YW5pc2xhdjM0MkBtYWlsaW5hdG9yLmNvbTETMBEGA1UEAwwK
U3RhbmlzbGF2MjENMAsGA1UECwwEaG9tZTENMAsGA1UECgwEaG9tZTEPMA0GA1UEBwwGTW9zY293
MQ8wDQYDVQQIDAZNb3Njb3cxCzAJBgNVBAYTAlJVMGMwHAYGKoUDAgITMBIGByqFAwICIwEGByqF
AwICHgEDQwAEQM6YeydTDIHEmgKCZtsG+2o+F8EWpeUAA/TOKijL/ShES+b/EKH4njwnu/xel6iY
fTXWnUCj6ndXpVnaNylttUyjggFjMIIBXzAOBgNVHQ8BAf8EBAMCBsAwEwYDVR0lBAwwCgYIKwYB
BQUHAwIwHQYDVR0OBBYEFNUXmfpSF9lzhYTawuFoPcTP6HwAMB8GA1UdIwQYMBaAFG2PXgXZX6yR
F5QelZoFMDg3ehAqMFUGA1UdHwROMEwwSqBIoEaGRGh0dHA6Ly93d3cuY3J5cHRvcHJvLnJ1L0Nl
cnRFbnJvbGwvVGVzdCUyMENlbnRlciUyMENSWVBUTy1QUk8oMikuY3JsMIGgBggrBgEFBQcBAQSB
kzCBkDAzBggrBgEFBQcwAYYnaHR0cDovL3d3dy5jcnlwdG9wcm8ucnUvb2NzcG5jL29jc3Auc3Jm
MFkGCCsGAQUFBzAChk1odHRwOi8vd3d3LmNyeXB0b3Byby5ydS9DZXJ0RW5yb2xsL3BraS1zaXRl
X1Rlc3QlMjBDZW50ZXIlMjBDUllQVE8tUFJPKDIpLmNydDAIBgYqhQMCAgMDQQATySuuBOjSymIe
77wWgHrIh0aF+mRv9BfM4XTkAUDKXCtyTTHmllWT9Icf+1mf3RPemrxCPd7ah6+R1WRyjBgD</X509Certificate></X509Data></KeyInfo></Signature></smev:AppData></smev:MessageData></ns:PutDocument></soap:Body></soap:Envelope>